SkilzBook/app/views/skills/show.html.erb

SELECT "builds".* FROM "builds" WHERE "builds"."skill_id" = $1  [["skill_id", 1]]
---

<% @skill.builds.each do |build| %>