SkilzBook/app/views/builds/show.html.erb

SELECT  "links".* FROM "links" WHERE "links"."build_id" = $1  ORDER BY "links"."id" DESC LIMIT 1  [["build_id", 1]]
SELECT "links".* FROM "links" WHERE "links"."build_id" = $1  [["build_id", 1]]
---
  </div>
<% if @build.links.last %>
  <% @build.links.each do |link| %>

SELECT  "comments".* FROM "comments" WHERE "comments"."build_id" = $1  ORDER BY "comments"."id" DESC LIMIT 1  [["build_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."build_id" = $1  [["build_id", 1]]
---
  <div class="comment_sekshin">
    <% if @build.comments.last %>
      <% @build.comments.each do |comment|%>