SkilzBook/app/controllers/builds_controller.rb

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    @skill = Skill.find(params[:skill_id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "builds" ("name", "details", "img_url", "skill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "King"], ["details", "dhdnghd"], ["img_url", "';'"], ["skill_id", 1], ["created_at", "2016-08-09 21:18:00.074232"], ["updated_at", "2016-08-09 21:18:00.074232"]]
---
  def create
    @skill = Skill.find(params[:skill_id])
    @skill.builds.create(build_params)

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @skill = Skill.find(params[:skill_id])
    @build = Build.find(params[:id])

SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @build = Build.find(params[:id])

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "builds" SET "img_url" = $1, "updated_at" = $2 WHERE "builds"."id" = $3  [["img_url", "http://tekken6-official.eu/templates/1/medias/img/photos/characters/hd//king.png"], ["updated_at", "2016-08-09 21:18:17.764747"], ["id", 2]]
---
  def update
    @skill = Skill.find(params[:skill_id])
    @build = Build.find(params[:id])
    @build.update(build_params)