app/controllers/links_controller.rb

SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @build = Build.find(params[:build_id])

SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "links" ("link_url", "title", "build_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["link_url", ""], ["title", "combos 1"], ["build_id", 1], ["created_at", "2016-08-09 21:17:22.478996"], ["updated_at", "2016-08-09 21:17:22.478996"]]
---
  def create
    @build = Build.find(params[:build_id])
    @skill = @build.skill
    @build.links.create!(link_params)

SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @build = Build.find(params[:build_id])
    @link = Link.find(params[:id])

SELECT  "builds".* FROM "builds" WHERE "builds"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "links" SET "link_url" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["link_url", "https://youtu.be/G9cOXel5mIQ?t=1m55s"], ["updated_at", "2016-08-09 21:17:27.463624"], ["id", 1]]
---
  def update
    @build = Build.find(params[:build_id])
    @skill = @build.skill
    @link = Link.find(params[:id])
    @link.update(link_params)